---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementStructuralTypeFilter
source: html/34773294-dac8-b837-9657-89c1805b5be0.htm
---
# ElementStructuralTypeFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.